#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Test_Tariq/gh-actions-demo/runs/run-EKjjSfVFUwgdc3op

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...
aws_apprunner_service.hello: Refreshing state... [id=arn:aws:apprunner:us-east-1:511073568994:service/hello-app-runner/0f57e9f4248645df8aae635d3b43aba7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apprunner_service.nginx will be created
  + resource "aws_apprunner_service" "nginx" {
      + arn                            = (known after apply)
      + auto_scaling_configuration_arn = (known after apply)
      + id                             = (known after apply)
      + service_id                     = (known after apply)
      + service_name                   = "tariq-nginx"
      + service_url                    = (known after apply)
      + status                         = (known after apply)
      + tags_all                       = (known after apply)

      + health_check_configuration {
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + path                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + instance_configuration {
          + cpu               = (known after apply)
          + instance_role_arn = (known after apply)
          + memory            = (known after apply)
        }

      + network_configuration {
          + egress_configuration {
              + egress_type       = (known after apply)
              + vpc_connector_arn = (known after apply)
            }
        }

      + source_configuration {
          + auto_deployments_enabled = false

          + image_repository {
              + image_identifier      = "public.ecr.aws/nginx/nginx:1-alpine-perl"
              + image_repository_type = "ECR_PUBLIC"

              + image_configuration {
                  + port = "80"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - apprunner_service_hello = {
      - arn                            = "arn:aws:apprunner:us-east-1:511073568994:service/hello-app-runner/0f57e9f4248645df8aae635d3b43aba7"
      - auto_scaling_configuration_arn = "arn:aws:apprunner:us-east-1:511073568994:autoscalingconfiguration/DefaultConfiguration/1/00000000000000000000000000000001"
      - encryption_configuration       = []
      - health_check_configuration     = [
          - {
              - healthy_threshold   = 1
              - interval            = 5
              - path                = "/"
              - protocol            = "TCP"
              - timeout             = 2
              - unhealthy_threshold = 5
            },
        ]
      - id                             = "arn:aws:apprunner:us-east-1:511073568994:service/hello-app-runner/0f57e9f4248645df8aae635d3b43aba7"
      - instance_configuration         = [
          - {
              - cpu               = "1024"
              - instance_role_arn = ""
              - memory            = "2048"
            },
        ]
      - network_configuration          = [
          - {
              - egress_configuration = [
                  - {
                      - egress_type       = "DEFAULT"
                      - vpc_connector_arn = ""
                    },
                ]
            },
        ]
      - observability_configuration    = []
      - service_id                     = "0f57e9f4248645df8aae635d3b43aba7"
      - service_name                   = "hello-app-runner"
      - service_url                    = "vqngcdzjmu.us-east-1.awsapprunner.com"
      - source_configuration           = [
          - {
              - authentication_configuration = []
              - auto_deployments_enabled     = false
              - code_repository              = []
              - image_repository             = [
                  - {
                      - image_configuration   = [
                          - {
                              - port                          = "8000"
                              - runtime_environment_variables = null
                              - start_command                 = ""
                            },
                        ]
                      - image_identifier      = "public.ecr.aws/aws-containers/hello-app-runner:latest"
                      - image_repository_type = "ECR_PUBLIC"
                    },
                ]
            },
        ]
      - status                         = "RUNNING"
      - tags                           = null
      - tags_all                       = {}
    } -> null
  + apprunner_service_nginx = {
      + arn                            = (known after apply)
      + auto_scaling_configuration_arn = (known after apply)
      + encryption_configuration       = []
      + health_check_configuration     = (known after apply)
      + id                             = (known after apply)
      + instance_configuration         = (known after apply)
      + network_configuration          = (known after apply)
      + observability_configuration    = []
      + service_id                     = (known after apply)
      + service_name                   = "tariq-nginx"
      + service_url                    = (known after apply)
      + source_configuration           = [
          + {
              + authentication_configuration = []
              + auto_deployments_enabled     = false
              + code_repository              = []
              + image_repository             = [
                  + {
                      + image_configuration   = [
                          + {
                              + port                          = "80"
                              + runtime_environment_variables = null
                              + start_command                 = null
                            },
                        ]
                      + image_identifier      = "public.ecr.aws/nginx/nginx:1-alpine-perl"
                      + image_repository_type = "ECR_PUBLIC"
                    },
                ]
            },
        ]
      + status                         = (known after apply)
      + tags                           = null
      + tags_all                       = (known after apply)
    }

```

</details>

*Pushed by: @Tarique-B, Action: `pull_request`*